## Introduction to Data Science

### Introduction to Pandas

In [1]:
import os
import pathlib
import time
import random
import math

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

#pd.set_option('display.max_rows', 500)
#pd.set_option('display.max_columns', 500)
#pd.set_option('display.width', 1000)

#import pylab
%matplotlib inline
#%matplotlib notebook

from IPython.core.display import display, HTML
display(HTML("<style>.container {width:90% !important;}</style>"))

### Pandas Data Structures: Series

In [2]:
obj = pd.Series([4, 7, -5, 3, 5])
obj

0    4
1    7
2   -5
3    3
4    5
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3,  5])

In [4]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan', 'Fernie']
obj

Bob       4
Steve     7
Jeff     -5
Ryan      3
Fernie    5
dtype: int64

In [6]:
obj['Bob']

4

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2['c']

3

In [9]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [10]:
obj2[obj2 < 0]

a   -5
dtype: int64

In [11]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [14]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [15]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [16]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [17]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [18]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### Pandas Data Structures: Dataframe

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],'year': [2000, 2001, 2002, 2001, 2002],'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [20]:
frame['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: pop, dtype: float64

In [21]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [22]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [23]:
frame2['nova'] = 13
frame2

       year   state  pop debt  nova
one    2000    Ohio  1.5  NaN    13
two    2001    Ohio  1.7  NaN    13
three  2002    Ohio  3.6  NaN    13
four   2001  Nevada  2.4  NaN    13
five   2002  Nevada  2.9  NaN    13

In [24]:
frame2.nova = 23
frame2

       year   state  pop debt  nova
one    2000    Ohio  1.5  NaN    23
two    2001    Ohio  1.7  NaN    23
three  2002    Ohio  3.6  NaN    23
four   2001  Nevada  2.4  NaN    23
five   2002  Nevada  2.9  NaN    23

In [25]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'nova'], dtype='object')

In [26]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [27]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [28]:
#frame2.loc['three']
frame2.loc['three','state']

'Ohio'

In [29]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5  16.5    23
two    2001    Ohio  1.7  16.5    23
three  2002    Ohio  3.6  16.5    23
four   2001  Nevada  2.4  16.5    23
five   2002  Nevada  2.9  16.5    23

In [30]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5   0.0    23
two    2001    Ohio  1.7   1.0    23
three  2002    Ohio  3.6   2.0    23
four   2001  Nevada  2.4   3.0    23
five   2002  Nevada  2.9   4.0    23

In [31]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5   NaN    23
two    2001    Ohio  1.7  -1.2    23
three  2002    Ohio  3.6   NaN    23
four   2001  Nevada  2.4  -1.5    23
five   2002  Nevada  2.9  -1.7    23

In [32]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  nova  eastern
one    2000    Ohio  1.5   NaN    23     True
two    2001    Ohio  1.7  -1.2    23     True
three  2002    Ohio  3.6   NaN    23     True
four   2001  Nevada  2.4  -1.5    23    False
five   2002  Nevada  2.9  -1.7    23    False

In [33]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'nova'], dtype='object')

In [34]:
transpose = frame2.pivot(index= 'year', columns='state', values='pop') 
transpose

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [35]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [36]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [37]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [38]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [39]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [40]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame4 = pd.DataFrame(pop)
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [41]:
frame4.loc[2000,'Nevada'] = 2
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [42]:
frame5 = pd.concat([frame4, frame4])
frame5

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [43]:
frame5.drop_duplicates(['Nevada'])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [44]:
dates = pd.date_range("20160101", periods=10)
data = np.random.random((10,3))
column_names = ['Column1', 'Column2', 'Column3']
df = pd.DataFrame(data, index=dates, columns=column_names)
df.head(10)

             Column1   Column2   Column3
2016-01-01  0.928388  0.594874  0.804069
2016-01-02  0.829654  0.815335  0.258463
2016-01-03  0.749010  0.369302  0.104183
2016-01-04  0.698710  0.306013  0.053756
2016-01-05  0.593000  0.834169  0.721664
2016-01-06  0.347383  0.127315  0.872961
2016-01-07  0.002016  0.968273  0.666584
2016-01-08  0.100123  0.873500  0.778967
2016-01-09  0.330141  0.671316  0.569181
2016-01-10  0.488155  0.156120  0.041730

In [45]:
df[1:3]

             Column1   Column2   Column3
2016-01-02  0.829654  0.815335  0.258463
2016-01-03  0.749010  0.369302  0.104183

In [46]:
df['20160104':'20160107']

             Column1   Column2   Column3
2016-01-04  0.698710  0.306013  0.053756
2016-01-05  0.593000  0.834169  0.721664
2016-01-06  0.347383  0.127315  0.872961
2016-01-07  0.002016  0.968273  0.666584

In [47]:
df.loc['20160101':'20160102',['Column1','Column3']]

             Column1   Column3
2016-01-01  0.928388  0.804069
2016-01-02  0.829654  0.258463

In [48]:
df.iloc[3:5, 0:2]

            Column1   Column2
2016-01-04  0.69871  0.306013
2016-01-05  0.59300  0.834169

In [49]:
df.describe()

         Column1    Column2    Column3
count  10.000000  10.000000  10.000000
mean    0.506658   0.571622   0.487156
std     0.309491   0.310698   0.335585
min     0.002016   0.127315   0.041730
25%     0.334452   0.321835   0.142753
50%     0.540578   0.633095   0.617883
75%     0.736435   0.829460   0.764641
max     0.928388   0.968273   0.872961

In [50]:
df.sort_index(axis=0, ascending=False,) # inplace=True)

             Column1   Column2   Column3
2016-01-10  0.488155  0.156120  0.041730
2016-01-09  0.330141  0.671316  0.569181
2016-01-08  0.100123  0.873500  0.778967
2016-01-07  0.002016  0.968273  0.666584
2016-01-06  0.347383  0.127315  0.872961
2016-01-05  0.593000  0.834169  0.721664
2016-01-04  0.698710  0.306013  0.053756
2016-01-03  0.749010  0.369302  0.104183
2016-01-02  0.829654  0.815335  0.258463
2016-01-01  0.928388  0.594874  0.804069

In [51]:
df.sort_values(by='Column2')

             Column1   Column2   Column3
2016-01-06  0.347383  0.127315  0.872961
2016-01-10  0.488155  0.156120  0.041730
2016-01-04  0.698710  0.306013  0.053756
2016-01-03  0.749010  0.369302  0.104183
2016-01-01  0.928388  0.594874  0.804069
2016-01-09  0.330141  0.671316  0.569181
2016-01-02  0.829654  0.815335  0.258463
2016-01-05  0.593000  0.834169  0.721664
2016-01-08  0.100123  0.873500  0.778967
2016-01-07  0.002016  0.968273  0.666584

In [52]:
dates1 = pd.date_range("20160101", periods=6)
data1 = np.random.random((6,2))
column_names1 = ['ColumnA', 'ColumnB']

dates2 = pd.date_range("20160101", periods=7)
data2 = np.random.random((7,2))
column_names2 = ['ColumnC', 'ColumnD']

df1 = pd.DataFrame(data1, index=dates1, columns=column_names1)
df2 = pd.DataFrame(data2, index=dates2, columns=column_names2)

In [53]:
df1.head()

             ColumnA   ColumnB
2016-01-01  0.781927  0.131879
2016-01-02  0.925735  0.486657
2016-01-03  0.996734  0.834458
2016-01-04  0.336548  0.276118
2016-01-05  0.834815  0.881880

In [54]:
df2.head()

             ColumnC   ColumnD
2016-01-01  0.590315  0.405498
2016-01-02  0.997325  0.650937
2016-01-03  0.882419  0.817229
2016-01-04  0.095935  0.927891
2016-01-05  0.424777  0.625904

In [55]:
df1.join(df2)

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.781927  0.131879  0.590315  0.405498
2016-01-02  0.925735  0.486657  0.997325  0.650937
2016-01-03  0.996734  0.834458  0.882419  0.817229
2016-01-04  0.336548  0.276118  0.095935  0.927891
2016-01-05  0.834815  0.881880  0.424777  0.625904
2016-01-06  0.853269  0.295395  0.919577  0.000849

In [56]:
df3 = df1.join(df2)

# add a column to df to group on
df3['ProfitLoss'] = pd.Series(['Profit', 
                               'Loss', 
                               'Profit', 
                               'Profit', 
                               'Profit', 
                               'Loss', 
                               'Profit', 
                               'Profit', 
                               'Profit', 
                               'Loss'], index=dates)

In [57]:
df3.head()

             ColumnA   ColumnB   ColumnC   ColumnD ProfitLoss
2016-01-01  0.781927  0.131879  0.590315  0.405498     Profit
2016-01-02  0.925735  0.486657  0.997325  0.650937       Loss
2016-01-03  0.996734  0.834458  0.882419  0.817229     Profit
2016-01-04  0.336548  0.276118  0.095935  0.927891     Profit
2016-01-05  0.834815  0.881880  0.424777  0.625904     Profit

In [58]:
df3.groupby('ProfitLoss').mean()

             ColumnA   ColumnB   ColumnC   ColumnD
ProfitLoss
Loss        0.889502  0.391026  0.958451  0.325893
Profit      0.737506  0.531084  0.498362  0.694130

### Pandas data types

* object : This data type is used for strings (i.e., sequences of characters)  
* int64 : Used for integers (whole numbers, no decimals)  
* float64 : Used for floating-point numbers (i.e., figures with decimals/fractions)  
* bool : Used for values that can only be True/False  
* datetime64 : Used for date and time values  
* timedelta : Used to represent the difference between datetimes  
* category : Used for values that take one out of a limited number of available options (categories dont have to, but can have explicit ordering)

To implement:
https://towardsdatascience.com/learn-advanced-features-for-pythons-main-data-analysis-library-in-20-minutes-d0eedd90d086

### Pandas Functions

#### idmin & idmax

In [59]:
df3['ColumnA'].idxmax()

Timestamp('2016-01-03 00:00:00', freq='D')

In [60]:
df3['ColumnA'].idxmin()

Timestamp('2016-01-04 00:00:00', freq='D')

ne()

In [61]:
df = pd.DataFrame()
df['x'] = [0,0,0,0,0,0,1,2,3,4,5,6,7]
df['x'].ne(0)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
12     True
Name: x, dtype: bool

In [62]:
df['x'].ne(0).idxmax()

6

In [63]:
df['x'].nsmallest(3)

0    0
1    0
2    0
Name: x, dtype: int64

In [64]:
df.nlargest(3, 'x')

    x
12  7
11  6
10  5

#### Pandas.melt()

In [65]:
# Create a test dataframe
# Untidy dataframe
# x : Subjects
# y : Student names

marks = pd.DataFrame(np.random.randint(0, 100, size = (30,5)), 
                     columns = ['Maths', 'Physics','Chemistry', 'Biology', 'Computer_Science'])

In [66]:
# Add student column to dataset
marks['Student'] = ['Student ' + str(i) for i in range(1,31)]
display(marks.head())

   Maths  Physics  Chemistry  Biology  Computer_Science    Student
0     62       84         71       22                47  Student 1
1     24       17         34       12                 1  Student 2
2     80       67         84       81                96  Student 3
3     25       41         17       77                38  Student 4
4     98       43         48       77                15  Student 5

In [67]:
# Bring last column to first position
cols = marks.columns.tolist()
marks = marks[['Student','Chemistry', 'Biology', 'Computer_Science', 'Maths', 'Physics']]

In [68]:
marks.head(10)

      Student  Chemistry  Biology  Computer_Science  Maths  Physics
0   Student 1         71       22                47     62       84
1   Student 2         34       12                 1     24       17
2   Student 3         84       81                96     80       67
3   Student 4         17       77                38     25       41
4   Student 5         48       77                15     98       43
5   Student 6         60       81                68     96       66
6   Student 7         51       29                82     43       24
7   Student 8         46       59                81     36       22
8   Student 9         82       92                77     15        6
9  Student 10         35       61                51     59        0

In [69]:
tidy = pd.melt(marks,
               id_vars = 'Student',
               value_name = 'Frequency')
tidy.head(10)

      Student   variable  Frequency
0   Student 1  Chemistry         71
1   Student 2  Chemistry         34
2   Student 3  Chemistry         84
3   Student 4  Chemistry         17
4   Student 5  Chemistry         48
5   Student 6  Chemistry         60
6   Student 7  Chemistry         51
7   Student 8  Chemistry         46
8   Student 9  Chemistry         82
9  Student 10  Chemistry         35

#### Applying Pandas Operations in Parallel

In [70]:
from pandarallel import pandarallel
from tqdm._tqdm_notebook import tqdm_notebook
tqdm_notebook.pandas()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: TqdmDeprecationWarning: This function will be removed in tqdm==5.0.0
Please use `tqdm.notebook.*` instead of `tqdm._tqdm_notebook.*`

In [71]:
pandarallel.initialize(progress_bar=True)

INFO: Pandarallel will run on 4 workers.
INFO: Pandarallel will use Memory file system to transfer data between the main process and workers.

In [72]:
df = pd.DataFrame({
    'A' : [random.randint(15,20) for i in range(1,1000000) ],
    'B' : [random.randint(10,30) for i in range(1,1000000) ]
})

In [73]:
def func(x):
    return math.sin(x.A**2) + math.sin(x.B**2) + math.tan(x.A**2)

WITHOUT PARALLELIZATION

In [74]:
%%time
res = df.progress_apply(func, axis=1)

HBox(children=(IntProgress(value=0, max=999999), HTML(value='')))

CPU times: user 59 s, sys: 422 ms, total: 59.5 s
Wall time: 59.2 s

WITH PARALLELIZATION

In [75]:
%%time
res_parallel = df.parallel_apply(func, axis=1)

VBox(children=(HBox(children=(IntProgress(value=0, description='0.00%', max=250000), Label(value='0 / 250000')

CPU times: user 1.05 s, sys: 95.8 ms, total: 1.15 s
Wall time: 25.6 s